<h2>Открытие и закрытие файлов</h2>
<h3>Для открытия файлов - fopen(). Она имеет следующее определение: resource fopen(string $filename, string $mode) </h3>
<p>'r': файл открывается только для чтения. Если файла не существует, возвращает false</p>
<p>'r+': файл открывается только для чтения с возможностью записи. Если файла не существует, возвращает false</p>
<p>'w': файл открывается для записи. Если такой файл уже существует, то он перезаписывается, если нет - то он создается</p>
<p>'w+': файл открывается для записи с возможностью чтения. Если такой файл уже существует, то он перезаписывается, если нет - то он создается</p>
<p>'a': файл открывается для записи. Если такой файл уже существует, то данные записываются в конец файла,<br> а старые данные остаются. Если файл не существует, то он создается</p>
<p>'a+': файл открывается для чтения и записи. Если файл уже существует, то данные дозаписываются в конец файла. Если файла нет, то он создается</p>
<?php
$fd = fopen("form.php", 'r') or die("не удалось открыть файл");
fclose($fd);
?>
<h2>Чтение файла</h2>
<H3>Для чтения используется fgets()</H3>
<?php

$fd = fopen("form.php", 'r') or die("Не удалось открыть файл");
while(!feof($fd))
{
    $str = htmlspecialchars(fgets($fd));
    echo "<br>$str</br>";
}
fclose($fd);
?>
<h2>Чтение файла полностью</h2>
<h3>Функция file_get_contents();</h3>
<?php
$str=htmlentities(file_get_contents("form.php"));
echo $str;
?>
<h2>Побочное считывание</h2>
<h3>Функция fread();</h3>
<?php
$fd = fopen("form.php", 'r') or die("Не удалось открыть файл");
while(!feof($fd))
{
    $str = htmlspecialchars(fgets($fd,600));
    echo "<br>$str";
}
fclose($fd);
?>
<h2>Запись файла</h2>
<h3>Функция fwrite();</h3>
<?php
$fd = fopen("hello.txt", 'w') or die("не удалось создать файл");
$str = "Привет мир";
fwrite($fd, $str);
fclose($fd);
?>
<h3>Так же работает функция fputs();</h3>
<?php
$fd = fopen("hello.txt", 'w') or die("не удалось создать файл");
$str = "Привет мир";
fputs($fd, $str);
fclose($fd);
?>
<h2>Работа с указателем файла</h2>
<h3>Функция fseek();</h3>
<p>SEEK_SET: значение по умолчанию, устанавливает смещение в offset байт относительно начала файла</p>
<p>SEEK_CUR: устанавливает смещение в offset байт относительно начала текущей позиции в файле</p>
<p>SEEK_END: устанавливает смещение в offset байт от конца файла</p>
<?php
$fd = fopen("hello.txt", 'w+') or die("Не удалось открыть файл");
$str = "Привет земля!";//Строка для записи
fwrite($fd, $str);//запишем строку в начало
fseek($fd, 0);//поместим указатель файла в начало
fwrite($fd, "Хрю");//Запишем в начало строку
fseek($fd, 0);//поместим указатель в конец
fwrite($fd,$str);//Запишем в конце еще одну строку
fclose($fd);
?>